accountsProxy/accountsProxy/src/gateway/duMockTargetServer/apiproxy/resources/node/du-mocks/orders/GetOMPFulfillmentRequests-Response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webservices.com/LCE/Du/WebServices" xmlns:head="http://www.du.ae/LCE/HeaderResponse" xmlns:lcew="http://xmlns.du.ae/LCE/Business/LCEWebServiceResponse" xmlns:get="http://xmlns.du.ae/LCE/Business/RequestManagement/GetOMPFulfillmentRequests">
   <soapenv:Header/>
   <soapenv:Body>
      <web:GetOMPFulfillmentRequestsResponse>
         <Response>
            <head:Header>
               <!--Optional:-->
               <head:RequestId>?</head:RequestId>
               <!--Optional:-->
               <head:CorrelationId>?</head:CorrelationId>
               <head:ResponseCode>?</head:ResponseCode>
               <!--Optional:-->
               <head:ResponseMessage>?</head:ResponseMessage>
               <!--Optional:-->
               <head:ErrorCode>?</head:ErrorCode>
               <!--Optional:-->
               <head:ErrorDescription>?</head:ErrorDescription>
            </head:Header>
            <!--Optional:-->
            <lcew:Body>
               <get:ListOfFulfillmentRequests>
                  <!--Zero or more repetitions:-->
                  <get:FulfillmentRequest>
                     <get:Id>?</get:Id>
                     <get:Name>?</get:Name>
                     <!--Optional:-->
                     <get:ExecutionNumber>?</get:ExecutionNumber>
                     <get:System>?</get:System>
                     <get:UpdatedDate>?</get:UpdatedDate>
                     <get:Status>?</get:Status>
                     <!--Optional:-->
                     <get:ErrorMessage>?</get:ErrorMessage>
                  </get:FulfillmentRequest>
               </get:ListOfFulfillmentRequests>
            </lcew:Body>
         </Response>
      </web:GetOMPFulfillmentRequestsResponse>
   </soapenv:Body>
</soapenv:Envelope>